# Розрахунок прибутку.
# Припустимо, що підприємство друкує рекламні листівки за ринковою ціною p (тобто можливості встановити ціну немає).
# Надійшло велике замовлення, яке потрібно виконати, потрібно виготовити n-ну кількість листівок.
# Товар виробляється в кількостях кратних 100, тобто замовити можна від 100, 200, 300 і т.д. листівок
# Для виробництва 100 листівок витрати будуть такого характеру:
# - майстер із друку (якому за 100 листівок платять 75 грн),
# - 100 аркушів спецпаперу (коштує 120 грн)
# - витрата чорнила на 100 аркушів паперу (20грн).
# Порахуйте, скільки компанія заробить залежно від ціни та кількості замовлених рекламних листівок
#
# Пам'ятайте, що прибуток рахується як виручка мінус витрати, де витрати це гроші,
# витрачені на роботу (людей) і матеріали

# p - ринкова ціна однієї листівки
# n - Кількість, яку потрібно надрукувати

def profit(p, n):
    if n % 100:
        return 'Кількість товару не кратна 100'

    number_hundreds = n // 100
    return n * p - number_hundreds * (75 + 120 + 20)

print(profit(2.5, 1000))
print(profit(2.5, 1005))
print(profit(5.5, 10000))