# Округлення чисел

"""
Згідно з офіційною документацією:

- ROUND_FLOOR: число округлюється до негативної нескінченності.
- ROUND_CEILING: число округлюється до нескінченності або позитивної нескінченності.
- ROUND_HALF_DOWN: числа округлюються до найближчого числа. Якщо є нічия, число округлюється до нуля. Зв'язки - це рівновіддалені числа, які можна округляти як у більшу, так і меншу сторону. Наприклад, таке число, як 4,25 можна округлити як у бік 4,2, так і 4,3.
- ROUND_HALF_UP: числа округлюються до найближчого числа. Якщо є нічия, число округлюється від нуля.
- ROUND_UP: число округлюється від нуля.
- ROUND_DOWN: число округлюється до нуля.
- ROUND_HALF_EVEN: числа округлюються до найближчого числа. Будь-які зв'язки округлюються до
найближчого парного цілого числа.
- ROUND_05UP: числа округлюються від нуля, якщо останнє число дорівнює 0 або 5. Якщо ні, числа округлюються до нуля.

За замовчуванням округлення описується константою ROUND_HALF_EVEN
"""
from decimal import Decimal, ROUND_HALF_EVEN, ROUND_HALF_UP

num = Decimal('1.45')
print(num.quantize(Decimal('1.0'), rounding=ROUND_HALF_EVEN))


num = Decimal('1.45')
print(num.quantize(Decimal('1.0'), rounding=ROUND_HALF_UP))