"""
Method Resolution Order (MRO).
MRO в Python працює наступним чином:

1. Шукає атрибут серед атрибутів самого класу. Саме завдяки цьому ви можете "перевизначати" батьківські атрибути.
2. Шукає атрибут у першого з батьків (той, що зазначено першим у списку батьків).
3. Шукає атрибут у наступного батька у списку батьків, доки такі є.
4. Шукає атрибут у батьках першого з батьків.
5. Повторює п.4 всім батьків.
6. Викликає виняток, що атрибут не знайдено.
"""

class A:
    def hi(self):
        print('A')

class B(A):
    pass
    # def hi(self):
    #     print('B')


class C(A):
    pass
    # def hi(self):
    #     print('C')


class D(B, C):
    pass
    # def hi(self):
    #     print('D')


d = D()
d.hi()
print(D.mro())